Repository: huy0301/Do_an_tot_nghiep-k15
Catalog: lib/l10n/app_*.arb
Languages: vi

# healthSummaryTitle
source: Health Summary
vi: Tóm tắt sức khỏe

source: Total plants tracked
vi: Tổng số cây đang theo dõi

source: Number of Healthy Plant
vi: Số lượng cây khỏe mạnh

source: Number of Risky Plant
vi: Số lượng cây có nguy cơ

source: Number of Diseased Plant
vi: Số lượng cây bị bệnh

# welcomeMessage
source: Welcome, {userName}!
vi: Chào mừng, {userName}!

# noTasksAdded
source: No tasks added yet!
vi: Chưa có nhiệm vụ nào được thêm!

# addTap
source: Add Task
vi: Thêm công việc

# todayTask
source: Today's Tasks
vi: Nhiệm vụ hôm nay

source: Plant Health Check
vi: Kiểm tra sức khỏe cây trồng

source: New Recommendation
vi: Đề xuất mới

source: Water Reminder
vi: Nhắc nhở tưới nước

source: AI Reminder
vi: Nhắc nhở AI
